# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "qmk/qmk"

# Brews
brew "bash"
brew "coreutils"
brew "fd"
brew "grep"
brew "pngpaste"
brew "qmk"
brew "ripgrep"

# Casks
cask "font-sf-pro"
cask "sf-symbols"
cask "alfred"
cask "displaperture"
cask "docker"
cask "dropbox"
cask "karabiner-elements"
cask "kitty"
cask "ledger-live"
cask "librewolf"
cask "logitech-options"
cask "mactex-no-gui"
cask "meetingbar"
cask "monero-wallet"
cask "nextcloud"
cask "pictogram"
cask "postman"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "signal"
cask "slack"
cask "sonos"
cask "spotify"
cask "tailscale"
cask "thunderbird"
cask "tor-browser"
cask "webpquicklook"
cask "yubico-yubikey-personalization-gui"
cask "zsa-wally"
